{
  "topics": [
    {
      "name": "ui-ux",

      "questions": {
        "easy": [
          { "id": 1, "question": "How would you define UI/UX design?" },
          {
            "id": 2,
            "question": "What is the difference between UI and UX design?"
          },
          { "id": 3, "question": "What is meant by design thinking?" },
          { "id": 4, "question": "What makes a good UI/UX designer?" },
          {
            "id": 5,
            "question": "What are the important skills for a UI/UX designer?"
          }
        ],
        "medium": [
          { "id": 6, "question": "Explain your design process." },
          { "id": 7, "question": "How do you conduct user research?" },
          {
            "id": 8,
            "question": "What is a user persona and why is it important in UX design?"
          },
          {
            "id": 9,
            "question": "How do you ensure accessibility in your designs?"
          }
        ],
        "difficult": [
          {
            "id": 10,
            "question": "Can you describe a challenging project you worked on and how you overcame the design obstacles?"
          },
          {
            "id": 11,
            "question": "How do you handle constructive criticism of your designs?"
          },
          {
            "id": 12,
            "question": "What techniques do you use to create effective information architecture and navigation systems?"
          },
          {
            "id": 13,
            "question": "How do you prioritize and incorporate user feedback into your design iterations?"
          },
          {
            "id": 14,
            "question": "What is usability testing and how is it conducted?"
          },
          {
            "id": 15,
            "question": "How do you balance user needs and business goals in your designs?"
          }
        ]
      }
    },
    {
      "name": "color-theory",

      "questions": {
        "easy": [
          { "id": 1, "question": "What is color theory?" },
          { "id": 2, "question": "What are the three primary colors?" },
          { "id": 3, "question": "What are the three secondary colors?" },
          {
            "id": 4,
            "question": "What is the difference between warm colors and cool colors?"
          },
          {
            "id": 5,
            "question": "How can you use color to create a sense of depth or distance?"
          }
        ],
        "medium": [
          {
            "id": 6,
            "question": "How can you use color theory to create a sense of contrast in a design?"
          },
          {
            "id": 7,
            "question": "How can you use color theory to create a sense of excitement in a design?"
          },
          {
            "id": 8,
            "question": "What are some of the latest trends in color theory and design?"
          },
          {
            "id": 9,
            "question": "How can you use color theory to create a sense of fun in a design?"
          }
        ],
        "difficult": [
          {
            "id": 10,
            "question": "How can you use color theory to create a sense of danger in a design?"
          },
          {
            "id": 11,
            "question": "How can you use color theory to create a sense of mystery in a design?"
          },
          {
            "id": 12,
            "question": "How can you use color theory to create a sense of hope in a design?"
          },
          {
            "id": 13,
            "question": "What techniques do you use to ensure effective color harmony in your designs?"
          },
          {
            "id": 14,
            "question": "How do you balance personal style with established color theory principles in your work?"
          },
          {
            "id": 15,
            "question": "Can you provide an example where your understanding of color theory significantly impacted your design outcome?"
          }
        ]
      }
    },
    {
      "name": "typography",

      "questions": {
        "easy": [
          { "id": 1, "question": "What is typography?" },
          {
            "id": 2,
            "question": "What is the difference between a font and a typeface?"
          },
          {
            "id": 3,
            "question": "What are the main classifications of typefaces?"
          },
          { "id": 4, "question": "What is point size in typography?" },
          { "id": 5, "question": "What is leading?" }
        ],
        "medium": [
          { "id": 6, "question": "What is kerning and why is it important?" },
          {
            "id": 7,
            "question": "Explain the concept of tracking in typography."
          },
          { "id": 8, "question": "What is a hierarchy of typography?" },
          { "id": 9, "question": "How does typography affect readability?" }
        ],
        "difficult": [
          {
            "id": 10,
            "question": "How can typography enhance the emotional impact of a design?"
          },
          {
            "id": 11,
            "question": "What are some common mistakes to avoid in typography?"
          },
          {
            "id": 12,
            "question": "How do you choose the right typeface for a project?"
          },
          {
            "id": 13,
            "question": "Can you discuss the role of typography in branding?"
          },
          {
            "id": 14,
            "question": "How do you approach designing for different screen sizes with typography?"
          },
          {
            "id": 15,
            "question": "What is the role of white space in typography?"
          }
        ]
      }
    },
    {
      "name": "adobe-suite",

      "questions": {
        "easy": [
          { "id": 1, "question": "What is Adobe Creative Suite?" },
          {
            "id": 2,
            "question": "What are the primary applications included in Adobe Suite?"
          },
          {
            "id": 3,
            "question": "What is Adobe Photoshop primarily used for?"
          },
          {
            "id": 4,
            "question": "How does Adobe Illustrator differ from Photoshop?"
          },
          { "id": 5, "question": "What is Adobe InDesign used for?" }
        ],
        "medium": [
          {
            "id": 6,
            "question": "Can you explain the difference between vector and raster graphics?"
          },
          { "id": 7, "question": "How do you use layers in Adobe Photoshop?" },
          {
            "id": 8,
            "question": "What are some common file formats used in Adobe applications?"
          },
          {
            "id": 9,
            "question": "How can you create a seamless pattern in Illustrator?"
          }
        ],
        "difficult": [
          {
            "id": 10,
            "question": "Describe your workflow when working on a project that involves multiple Adobe applications."
          },
          {
            "id": 11,
            "question": "How do you optimize images for web use in Photoshop?"
          },
          {
            "id": 12,
            "question": "What techniques do you use to ensure consistency across various design elements in a project?"
          },
          {
            "id": 13,
            "question": "Can you discuss a challenging project you completed using Adobe Suite and how you overcame obstacles?"
          },
          {
            "id": 14,
            "question": "How do you stay updated on new features and tools within the Adobe Suite?"
          },
          {
            "id": 15,
            "question": "What is your approach to collaborating with team members using Adobe Creative Cloud?"
          }
        ]
      }
    }
  ]
}
